features/a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://www.symxchange.generated.symitar.com/v2/account" xmlns:com="http://www.symxchange.generated.symitar.com/v1/common/dto/common">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:createEft>
         <!--Optional:-->
         <Request MessageId="?" acc:BranchId="?">
            <!--Optional:-->
            <EftCreatableFields>
               <!--Optional:-->
               <AmountCode>?</AmountCode>
               <!--Optional:-->
               <AmountYtd>?</AmountYtd>
               <!--Optional:-->
               <AudioId>?</AudioId>
               <!--Optional:-->
               <Balance>?</Balance>
               <!--Optional:-->
               <BatchAchOrigNum>?</BatchAchOrigNum>
               <!--Optional:-->
               <CountYtd>?</CountYtd>
               <!--Optional:-->
               <CreditLimit>?</CreditLimit>
               <!--Optional:-->
               <Day1>?</Day1>
               <!--Optional:-->
               <Day2>?</Day2>
               <!--Optional:-->
               <DeferDate>?</DeferDate>
               <!--Optional:-->
               <DistributionRatio>?</DistributionRatio>
               <!--Optional:-->
               <DqCount>?</DqCount>
               <!--Optional:-->
               <EffectiveDate>?</EffectiveDate>
               <!--Optional:-->
               <ExpirationDate>?</ExpirationDate>
               <!--Optional:-->
               <FederalWithholding>?</FederalWithholding>
               <!--Optional:-->
               <Frequency>?</Frequency>
               <!--Optional:-->
               <GlCode>?</GlCode>
               <!--Optional:-->
               <GroupNumber>?</GroupNumber>
               <!--Optional:-->
               <Id>?</Id>
               <!--Optional:-->
               <IdType>?</IdType>
               <!--Optional:-->
               <LastTranAmount>?</LastTranAmount>
               <!--Optional:-->
               <LastTranDate>?</LastTranDate>
               <!--Optional:-->
               <MatchCode1>?</MatchCode1>
               <!--Optional:-->
               <MatchCode2>?</MatchCode2>
               <!--Optional:-->
               <MatchCode3>?</MatchCode3>
               <!--Optional:-->
               <MatchCode4>?</MatchCode4>
               <!--Optional:-->
               <MatchCode5>?</MatchCode5>
               <!--Optional:-->
               <MatchCode6>?</MatchCode6>
               <!--Optional:-->
               <MatchId1>?</MatchId1>
               <!--Optional:-->
               <MatchId2>?</MatchId2>
               <!--Optional:-->
               <MatchId3>?</MatchId3>
               <!--Optional:-->
               <MatchId4>?</MatchId4>
               <!--Optional:-->
               <MatchId5>?</MatchId5>
               <!--Optional:-->
               <MatchId6>?</MatchId6>
               <!--Optional:-->
               <NextDate>?</NextDate>
               <!--Optional:-->
               <Payee>?</Payee>
               <!--Optional:-->
               <PostAmount>?</PostAmount>
               <!--Optional:-->
               <PostFreq>?</PostFreq>
               <!--Optional:-->
               <Reference>?</Reference>
               <!--Optional:-->
               <Reference2>?</Reference2>
               <!--Optional:-->
               <RegDCode>?</RegDCode>
               <!--Optional:-->
               <SpecificAmount>?</SpecificAmount>
               <!--Optional:-->
               <StandardAmount>?</StandardAmount>
               <!--Optional:-->
               <StateWithholding>?</StateWithholding>
               <!--Optional:-->
               <Status>?</Status>
               <!--Optional:-->
               <Type>?</Type>
            </EftCreatableFields>
            <!--Optional:-->
            <AccountNumber>?</AccountNumber>
            <!--Optional:-->
            <Credentials com:ProcessorUser="?">
               <!--You have a CHOICE of the next 8 items at this level-->
               <!--Optional:-->
               <AccountNumberCredentials>
                  <!--Optional:-->
                  <AccountNumber>?</AccountNumber>
                  <!--Optional:-->
                  <OptionalUserCode>?</OptionalUserCode>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <!--Optional:-->
                  <HomeBankingPassword>?</HomeBankingPassword>
                  <!--Optional:-->
                  <AudioAccessCode>?</AudioAccessCode>
                  <!--Optional:-->
                  <SecondaryVerification>
                     <!--Optional:-->
                     <SocialSecurityNumber>?</SocialSecurityNumber>
                     <!--Optional:-->
                     <SSNLastFourDigits>?</SSNLastFourDigits>
                     <!--Optional:-->
                     <SecondaryHomeBankingPassword>?</SecondaryHomeBankingPassword>
                     <!--Optional:-->
                     <SecondaryAudioAccessCode>?</SecondaryAudioAccessCode>
                  </SecondaryVerification>
               </AccountNumberCredentials>
               <!--Optional:-->
               <HomeBankingCredentials>
                  <!--Optional:-->
                  <UserName>?</UserName>
                  <!--Optional:-->
                  <Password>?</Password>
                  <!--Optional:-->
                  <SecondaryVerification>
                     <!--Optional:-->
                     <SocialSecurityNumber>?</SocialSecurityNumber>
                     <!--Optional:-->
                     <SSNLastFourDigits>?</SSNLastFourDigits>
                     <!--Optional:-->
                     <SecondaryHomeBankingPassword>?</SecondaryHomeBankingPassword>
                     <!--Optional:-->
                     <SecondaryAudioAccessCode>?</SecondaryAudioAccessCode>
                  </SecondaryVerification>
               </HomeBankingCredentials>
               <!--Optional:-->
               <CardCredentials>
                  <!--Optional:-->
                  <CardNumber>?</CardNumber>
               </CardCredentials>
               <!--Optional:-->
               <MICRCredentials>
                  <!--Optional:-->
                  <MICRNumber>?</MICRNumber>
               </MICRCredentials>
               <!--Optional:-->
               <LookupCredentials>
                  <!--Optional:-->
                  <Type>?</Type>
                  <!--Optional:-->
                  <Value>?</Value>
                  <!--Optional:-->
                  <OptionalUserCode>?</OptionalUserCode>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <!--Optional:-->
                  <HomeBankingPassword>?</HomeBankingPassword>
                  <!--Optional:-->
                  <AudioAccessCode>?</AudioAccessCode>
                  <!--Optional:-->
                  <SecondaryVerification>
                     <!--Optional:-->
                     <SocialSecurityNumber>?</SocialSecurityNumber>
                     <!--Optional:-->
                     <SSNLastFourDigits>?</SSNLastFourDigits>
                     <!--Optional:-->
                     <SecondaryHomeBankingPassword>?</SecondaryHomeBankingPassword>
                     <!--Optional:-->
                     <SecondaryAudioAccessCode>?</SecondaryAudioAccessCode>
                  </SecondaryVerification>
               </LookupCredentials>
               <!--Optional:-->
               <UserNumberCredentials>
                  <!--Optional:-->
                  <UserNumber>?</UserNumber>
                  <!--Optional:-->
                  <Password>?</Password>
               </UserNumberCredentials>
               <!--Optional:-->
               <AdministrativeCredentials>
                  <!--Optional:-->
                  <Password>?</Password>
               </AdministrativeCredentials>
               <!--Optional:-->
               <TokenCredentials>
                  <!--Optional:-->
                  <TokenId>?</TokenId>
               </TokenCredentials>
            </Credentials>
            <!--Optional:-->
            <DeviceInformation DeviceType="?" DeviceNumber="?"/>
         </Request>
      </acc:createEft>
   </soapenv:Body>
</soapenv:Envelope>